In [1]:
#Use for ETL
#Two types of pandas data structure

#Series-

import pandas as pd
df=pd.Series([1,2,3,4])
df

0    1
1    2
2    3
3    4
dtype: int64

In [2]:
#For specify our own index

import pandas as pd
df=pd.Series([1,2,3,4],index=['a','b','c','d'])
df

a    1
b    2
c    3
d    4
dtype: int64

In [3]:
#Dataframe

import pandas as pd
df=pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [4]:
#Using list

import pandas as pd
list=["Chetana","Rane","Hello"]
df=pd.DataFrame(list)
df

         0
0  Chetana
1     Rane
2    Hello

In [5]:
#Using Dictionary

data={"Over":[1,2,3,4,5],"Runs":[50,20,100,90,30]}
df=pd.DataFrame(data)
df

   Over  Runs
0     1    50
1     2    20
2     3   100
3     4    90
4     5    30

In [6]:
#head

df.head(2) #Will print first 2 rows of the dataframe

   Over  Runs
0     1    50
1     2    20

In [7]:
df.head() #Will print first 5 rows of the dataframe

   Over  Runs
0     1    50
1     2    20
2     3   100
3     4    90
4     5    30

In [8]:
df.tail() # last five lines

   Over  Runs
0     1    50
1     2    20
2     3   100
3     4    90
4     5    30

In [9]:
df.tail(3) #last 3 lines

   Over  Runs
2     3   100
3     4    90
4     5    30

In [10]:
df.describe() #display statistical analysis

           Over        Runs
count  5.000000    5.000000
mean   3.000000   58.000000
std    1.581139   35.637059
min    1.000000   20.000000
25%    2.000000   30.000000
50%    3.000000   50.000000
75%    4.000000   90.000000
max    5.000000  100.000000

In [11]:
df.shape #shape of dataset in the form of rows*columns

(5, 2)

In [12]:
df.columns  #Indexes

Index(['Over', 'Runs'], dtype='object')

In [13]:
df.loc[2] #for accesing the particular data

Over      3
Runs    100
Name: 2, dtype: int64

In [14]:
#Example

import pandas as pd
dict={"rollno":[1,2,3,4],"name":["dd","ff","gg","hh"],"marks":[18,46,35,97]}
df=pd.DataFrame(dict)
print(df)

   rollno name  marks
0       1   dd     18
1       2   ff     46
2       3   gg     35
3       4   hh     97

In [15]:
df.shape

(4, 3)

In [16]:
df.loc[1]

rollno     2
name      ff
marks     46
Name: 1, dtype: object

In [17]:
df.loc[0:1]

   rollno name  marks
0       1   dd     18
1       2   ff     46

In [18]:
df["name"]

0    dd
1    ff
2    gg
3    hh
Name: name, dtype: object

In [19]:
df[(df["marks"]<90)]

   rollno name  marks
0       1   dd     18
1       2   ff     46
2       3   gg     35

Query Function

In [20]:
import pandas as pd

data = {'name': ['Alice', 'Bob', 'Charlie', 'David'],'age': [25, 30, 35, 40],'salary': [50000, 60000, 70000, 80000],'department': ['HR', 'IT', 'Finance', 'Marketing']}

df = pd.DataFrame(data)
df

      name  age  salary department
0    Alice   25   50000         HR
1      Bob   30   60000         IT
2  Charlie   35   70000    Finance
3    David   40   80000  Marketing

In [21]:
# Select rows where age is greater than 30
result = df.query('age > 30')
print(result)

      name  age  salary department
2  Charlie   35   70000    Finance
3    David   40   80000  Marketing

In [22]:
# Select rows where age is greater than 30 and salary is above 70000
result = df.query('age > 30 & salary > 70000')
print(result)

    name  age  salary department
3  David   40   80000  Marketing

In [23]:
result = df[df['name'].str.startswith('C')]
print(result)

      name  age  salary department
2  Charlie   35   70000    Finance

Unfuncs:Index Presentation

In [26]:
import pandas as pd
import numpy as np
rng=np.random.RandomState(42) # 42 for generating the same random number all the time whenever we are running it
ser=pd.Series(rng.randint(0,10,4))
print(ser)

0    6
1    3
2    7
3    4
dtype: int32

In [29]:
import pandas as pd
import numpy as np
rng=np.random.RandomState() # for generating the random number, we will get different numbers whenever we are running the code
ser=pd.Series(rng.randint(0,10,4))
print(ser)

0    7
1    2
2    1
3    3
dtype: int32

In [30]:
import pandas as pd
import numpy as np
rng=np.random.RandomState() # for generating the random number, we will get different numbers whenever we are running the code
ser=pd.Series(rng.randint(10,200,10))
print(ser)

0    135
1     55
2    150
3     24
4    177
5    155
6    135
7    148
8    169
9     33
dtype: int32

Create dataframe using randint()

In [36]:
df = pd.DataFrame(rng.randint(0,10,(3,4)),columns=['A','B','C','D'])
print(df)

   A  B  C  D
0  3  6  8  0
1  3  7  3  0
2  9  8  9  7